1c1
< reference results for version 0
---
> reference results for version 1
5c5
< type:table|name:g1|tbl_name:g1|rootpage:8|sql:CREATE TABLE g1( id INTEGER PRIMARY KEY, name TEXT )
---
> type:table|name:g1|tbl_name:g1|rootpage:10|sql:CREATE TABLE g1( id INTEGER PRIMARY KEY, name TEXT )
17c17,21
< type:table|name:test_create_table_A|tbl_name:test_create_table_A|rootpage:4|sql:CREATE TABLE test_create_table_A( colA INTEGER, colB LONG_INT, colC TEXT )
---
> type:table|name:test_create_table_A|tbl_name:test_create_table_A|rootpage:4|sql:CREATE TABLE test_create_table_A( colA INTEGER, colB LONG_INT, colC TEXT , colD TEXT)
> 
> ----- test_create_table_B -----
> 
> type:table|name:test_create_table_B|tbl_name:test_create_table_B|rootpage:5|sql:CREATE TABLE test_create_table_B( colA TEXT, colB LONG_INT, colC INTEGER )
21c25
< type:table|name:test_recreate_table_A|tbl_name:test_recreate_table_A|rootpage:6|sql:CREATE TABLE test_recreate_table_A( colA INTEGER, colB LONG_INT, colC TEXT )
---
> type:table|name:test_recreate_table_A|tbl_name:test_recreate_table_A|rootpage:8|sql:CREATE TABLE test_recreate_table_A( colA INTEGER, colC TEXT, colD TEXT )
23c27
< ----- test_this_table_will_become_create -----
---
> ----- test_recreate_table_B -----
25c29
< type:table|name:test_this_table_will_become_create|tbl_name:test_this_table_will_become_create|rootpage:5|sql:CREATE TABLE test_this_table_will_become_create( xyzzy INTEGER )
---
> type:table|name:test_recreate_table_B|tbl_name:test_recreate_table_B|rootpage:7|sql:CREATE TABLE test_recreate_table_B( colA INTEGER, colB LONG_INT, colC INTEGER )
27c31
< ----- tr__dummy -----
---
> ----- test_this_table_will_become_create -----
29c33
< type:trigger|name:tr__dummy|tbl_name:test_create_table_A|rootpage:0|sql:CREATE TRIGGER tr__dummy BEFORE DELETE ON test_create_table_A BEGIN SELECT 1; END
---
> type:table|name:test_this_table_will_become_create|tbl_name:test_this_table_will_become_create|rootpage:6|sql:CREATE TABLE test_this_table_will_become_create( id INTEGER PRIMARY KEY )
33c37
< type:table|name:use_g1|tbl_name:use_g1|rootpage:7|sql:CREATE TABLE use_g1( id INTEGER PRIMARY KEY REFERENCES g1 (id), name2 TEXT )
---
> type:table|name:use_g1|tbl_name:use_g1|rootpage:9|sql:CREATE TABLE use_g1( id INTEGER PRIMARY KEY REFERENCES g1 (id), name2 TEXT )
